Show / Hide Table of Contents
Class AnchorGrid
Data of the anchor grid
Inheritance
System.Object
BoltGrid
AnchorGrid
Inherited Members
 BoltGrid.Id
 BoltGrid.IsAnchor
 BoltGrid.AnchorLen
 BoltGrid.HoleDiameter
 BoltGrid.Diameter
 BoltGrid.HeadDiameter
 BoltGrid.DiagonalHeadDiameter
 BoltGrid.HeadHeight
 BoltGrid.BoreHole
 BoltGrid.TensileStressArea
 BoltGrid.NutThickness
 BoltGrid.BoltAssemblyName
 BoltGrid.Standard
 BoltGrid.Material
 BoltGrid.Origin
 BoltGrid.AxisX
 BoltGrid.AxisY
 BoltGrid.AxisZ
 BoltGrid.Positions
 BoltGrid.ConnectedPlates
 BoltGrid.ConnectedPartIds
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class AnchorGrid : BoltGrid
Properties
Improve this Doc   View Source
ConcreteBlock
Data of concrete block
Declaration
public ConcreteBlock ConcreteBlock { get; set; }
Property Value
 Type |  Description
 ConcreteBlock
 Improve this Doc
 View Source